# Вычислите длину окружности, площадь круга и объём шара одного и
# того же заданного радиуса

import math

PI=math.pi
r=float(input())

c=2*PI*r
S=PI*r*r
V=(4/3)*PI*r*r*r

print(c)
print(S)
print(V)
